# St7SetEntityContourIndex

Sets a contour type from the combo box menus in Entity Display for beam, plate or brick elements.

long St7SetEntityContourIndex(long uID, long Entity, long Index)

Input Parameters

uID

Strand7 model file ID.

Entity

One of tyBEAM, tyPLATE or tyBRICK.

Index

A contour specified by the constants listed in Entity Contours.